/*
Задача № 8
Вывести на экран числа от -N до N
*/
int start = -10;
int end = 10;
while (start <= end)
{
    System.Console.Write($"{start} ");
    start++;
}