/*
Задача № 8
Вывести на экран числа от -N до N
*/
int N = 10;
int Nneg = -N;

while (Nneg <= N)
{
    System.Console.Write($"{Nneg} ");
    Nneg++;
}