// Задача 64: Задайте значения M и N. Напишите программу, 
//которая выведет все натуральные числа в промежутке от M до N.
// M = 1; N = 5. -> ""1, 2, 3, 4, 5""
// M = 4; N = 8. -> ""4, 5, 6, 7, 8""

void Loop(int M, int N)
{
  System.Console.Write($"{M} ");
  if (M < N)
  {
    Loop(M + 1, N);
  }

}

Loop(1, 5);