/*
Задача № 13
Удалить вторую цифру целого числа введенного с клавиатуры.
*/
// System.Console.WriteLine("Введите целое число: ");
// int num = int.Parse(Console.ReadLine());

// int num = 12345;
// int i = 0;
// int numExit;
// for (i = 0; i <= 2; i++)
// {
//   int last_digit = num % 10;
//   num = num / 10;
//   i++;
//   numExit = num;
// }
// System.Console.Write($"{num}{numExit % 10}");


// получение 2 ой цирфы числа

// if (num > 99)
// {
//   System.Console.WriteLine(num % 100 / 10);
// }
// else
// {
//   System.Console.WriteLine($"Число {num} двузначное! Введите число, в котором более двух цифр.");
// }
