/*
Задача № 11
Дано число больше 9. Вывести на экран  вторую цифру числа с конца
*/
int a = 65487;

int c = a % 10;

System.Console.WriteLine(c);